/*
   В этом проекте представлено третье приложение из шестого модуля. Классы приложения расположены в своих пакетах,
   согласно логике. Код сопровожден минимальными комментариями. Основная информация по работе приложения представлена
   в файле README.md
 */

/*
    Задание 3: создайте клиент-серверное приложение “Архив”.
    Общие требования к заданию:
    • В архиве хранятся Дела (например, студентов). Архив находится на сервере.
    • Клиент, в зависимости от прав, может запросить дело на просмотр, внести в
    него изменения, или создать новое дело.
    Требования к коду лабораторной работы:
    • Для реализации сетевого соединения используйте сокеты.
    • Формат хранения данных на сервере – xml-файлы.
 */
public class Main {
}
