/*
    В этом пакете представлены решения заданий четвертой части, раздела "Агрегация и композиция". Каждое задание
    представлено отдельным пакетом с пояснениями в виде комментариев.
 */
package aggregation.and.composition.TaskOne;
/*
    Агрегация и композиция.
    Задание №1.
    Создать объект класса Текст, используя классы Предложение, Слово. Методы: дополнить текст, вывести на
    консоль текст, заголовок текста.
 */

public class TaskOne {
    public static void main(String[] args) {

    }
}
