package sorting;

    /*
    Одномерные массивы. Сортировки.
    Задача №6.
    Сортировка Шелла. Дан массив n действительных чисел. Требуется упорядочить его по возрастанию. Делается это
    следующим образом: сравниваются два соседних элемента Ai и Ai+1. Если Ai <= Ai+1, то продвигаются на один элемент
    вперед. Если Ai > Ai+1, то производится перестановка и сдвигаются на один элемент назад. Составить алгоритм этой
    сортировки.

     */

public class TaskSix {
    public static void main(String[] args) {

    }
}
