package aggregation.and.composition.TaskFour;

/*
    Агрегация и композиция.
    Задание №4.
    Счета. Клиент может иметь несколько счетов в банке. Учитывать возможность блокировки/разблокировки
    счета. Реализовать поиск и сортировку счетов. Вычисление общей суммы по счетам. Вычисление суммы по
    всем счетам, имеющим положительный и отрицательный балансы отдельно.
 */


import java.util.Arrays;

public class TaskFour {
    //Закомментированный хардкод для проверки выводов.
    public static void main(String[] args) throws IllegalAccessException {
//        Deposit deposit = new Deposit(0);
//        deposit.setBalance(+1_000);
//        Deposit deposit1 = new Deposit(1);
//        deposit1.setBalance(-2_010);
//        Deposit deposit2 = new Deposit(2);
//        deposit2.setBalance(+10_000);
//        deposit2.setBlocked(true);
//        Client client = new Client("Alex");
//        client.addDeposit(deposit);
//        client.addDeposit(deposit1);
//        client.addDeposit(deposit2);
//        System.out.println(client.toString());
//        System.out.println("Negative summary: " + client.depositsSumNegative());
//        System.out.println("Positive summary: " + client.depositsSumPositive());
//        System.out.println("All summary: " + client.depositsSum());
//        System.out.println(client.findDeposit(2).toString());
//        System.out.println(Arrays.toString(client.getDeposits()));
//        client.sortDeposits();
//        System.out.println(Arrays.toString(client.getDeposits()));
    }
}
