package simple.classes.and.objects.TaskSix;

/*
    Простейшие классы и объекты.
    Задание №6.
    Составьте описание класса для представления времени. Предусмотрите возможности установки времени и изменения его
    отдельных полей (час, минута, секунда) с проверкой допустимости вводимых значений. В случае недопустимых значений
    полей поле устанавливается в значение 0. Создать методы изменения времени на заданное количество часов, минут и
    секунд.

 */

public class TaskSix {
    public static void main(String[] args) {
        //Закомментированый хард-код, использованный для проверки и демонстрации.

//        Time time = new Time();
//        time.outPut();
//        Time time1 = new Time(10,44,11);
//        time1.outPut();
//        time.changeHours(10);
//        time.changeMinute(-2);
//        time.outPut();
//        time.setAllData(1,24,24);
//        time.outPut();
    }
}
