package simple.classes.and.objects.TaskTen;

/*
    Простейшие классы и объекты.
    Задание №10.
    Создать класс Airline, спецификация которого приведена ниже. Определить конструкторы, set- и get- методы и метод
    toString(). Создать второй класс, агрегирующий массив типа Airline, с подходящими конструкторами и методами.
    Задать критерии выбора данных и вывести эти данные на консоль.

        Airline: пункт назначения, номер рейса, тип самолета, время вылета, дни недели.
        Найти и вывести:
        a) список рейсов для заданного пункта назначения;
        b) список рейсов для заданного дня недели;
        c) список рейсов для заданного дня недели, время вылета для которых больше заданного.

 */


import java.sql.Time;

public class TaskTen {
    //Закомментированный хардкод для проверки работоспособности заданных выводов.

    public static void main(String[] args) {
//        Airline[] arrayAir = Airline.createAirlineArray(5);
//        Time time = new Time(10, 20, 00);
//        Time time2 = new Time(13, 30, 00);
//        Time time3 = new Time(14, 50, 00);
//        Time time4 = new Time(10, 25, 00);
//        Time time5 = new Time(11, 10, 00);
//        arrayAir[0].setAllData("Moscow", 1833, "B733", time ,Week.MONDAY);
//        arrayAir[1].setAllData("Minsk", 833, "B733", time2 ,Week.MONDAY);
//        arrayAir[2].setAllData("Minsk", 834, "B733", time3 ,Week.THURSDAY);
//        arrayAir[3].setAllData("Moscow", 1834, "B733", time4 ,Week.TUESDAY);
//        arrayAir[4].setAllData("Moscow", 1835, "B733", time5 ,Week.SUNDAY);
//
//        AirlineArray array = new AirlineArray(arrayAir);
//        array.printDayList(Week.MONDAY);
//        System.out.println();
//        array.printDayTimeList(Week.MONDAY,time);
//        System.out.println();
//        array.printDestinationList("Moscow");
    }
}
