package simple.classes.and.objects.TaskFive;

/*
    Простейшие классы и объекты.
    Задание №5.
    Опишите класс, реализующий десятичный счетчик, который может увеличивать или уменьшать свое значение на единицу
    в заданном диапазоне. Предусмотрите инициализацию счетчика значениями по умолчанию и произвольными значениями.
    Счетчик имеет методы увеличения и умньшения состояния, и метод позволяющий получить его текущее состояние.
    Написать код, демонстрирующий все возможности класса.

 */

public class TaskFive {
}
