package aggregation.and.composition.TaskFive;

/*
    Агрегация и композиция.
    Задание №5.
    Туристические путевки. Сформировать набор предложений клиенту по выбору туристической путевки
    различного типа (отдых, экскурсии, лечение, шопинг, круиз и т. д.) для оптимального выбора. Учитывать
    возможность выбора транспорта, питания и числа дней. Реализовать выбор и сортировку путевок.
 */


import java.util.Arrays;

public class TaskFive {
    //Закомментированный хардкод для проверки выводов.
    public static void main(String[] args) {
//        VoucherBase base = new VoucherBase();
//        Voucher rome = new Voucher("Rome",10,Transport.AIRPLANE,Supply.AI,VoucherType.EXCURSIONS,1000);
//        base.addVoucher(rome);
//        Voucher monaco = new Voucher("Monaco", 3, Transport.TRAIN,Supply.OB,VoucherType.SHOPPING, 560);
//        base.addVoucher(monaco);
//        Voucher atlanticOcean = new Voucher("Atlantic ocean", 15, Transport.LINER,Supply.AI,VoucherType.CRUISE, 2500);
//        base.addVoucher(atlanticOcean);
//        Voucher moon = new Voucher("Moon", 10,Transport.FALCON9,Supply.AI,VoucherType.REST,115_000);
//        base.addVoucher(moon);
//        Voucher minskSea = new Voucher("Minsk Sea", 5, Transport.HIKING,Supply.FB,VoucherType.THERAPY,100);
//        base.addVoucher(minskSea);
//        base.showDay(10);
//        System.out.println();
//        base.showTransport(Transport.TRAIN);
//        System.out.println();
//        base.showFood(Supply.AI);
//        System.out.println();
//        Voucher myChoose = base.chooseVoucher("Moon");
//        System.out.println(myChoose.toString());
//        System.out.println();
//        System.out.println(Arrays.toString(base.getVouchers()));
    }
}
