package simple.classes.and.objects.TaskNine;

/*
    Простейшие классы и объекты.
    Задание №9.
    Создать класс Book, спецификация которого приведена ниже. Определить конструкторы, set- и get- методы и метод
    toString(). Создать второй класс, агрегирующий массив типа Book, с подходящими конструкторами и методами.
    Задать критерии выбора данных и вывести эти данные на консоль.

            Book: id, название, автор(ы), издательство, год издания, количество страниц, цена, тип переплета.
            Найти и вывести:
            a) список книг заданного автора;
            b) список книг, выпущенных заданным издательством;
            c) список книг, выпущенных после заданного года.

 */


public class TaskNine {

    //Закомментированный хард-код для проверки работоспособности заданных выводов.

    public static void main(String[] args) {
//        Book[] array = Book.createBook(5);
//        array[0].setAllData(1, "Вот я", "Джонатан Фойер", "Эскмо",2014,615,30,"Твердый");
//        array[1].setAllData(2, "Полная иллюминация", "Джонатан Фойер", "Эскмо",2010,405,25,"Твердый");
//        array[2].setAllData(3, "Мойдодыр", "Корней Чуйковский", "Росмэн",1964,55,5,"Мягкий");
//        array[3].setAllData(4, "Вот я", "Джонатан Фойер", "Эскмо",2014,615,30,"Мягкий");
//        array[4].setAllData(5, "Алхимик", "Пауло Коэльо", "Росмэн",1982,311,20,"Мягкий");
//
//        BookArray arrayBook = new BookArray(array);
//        arrayBook.printAuthorList("Джонатан Фойер");
//        System.out.println();
//        arrayBook.printPublishingList("Росмэн");
//        System.out.println();
//        arrayBook.printYearList(1980);
    }
}
