package simple.classes.and.objects.TaskEight;

/*
    Простейшие классы и объекты.
    Задание №8.
    Создать класс Customer, спецификация которого приведена ниже. Определить конструкторы, set- и get- методы и
    метод toString(). Создать второй класс, агрегирующий массив типа Customer, с подходящими конструкторами и
    методами. Задать критерии выбора данных и вывести эти данные на консоль.

        Класс Customer: id, фамилия, имя, отчество, адрес, номер кредитной карточки, номер банковского счета.
        Найти и вывести:
        a) список покупателей в алфавитном порядке;
        b) список покупателей, у которых номер кредитной карточки находится в заданном интервале

 */


public class TaskEight {
    //Закомментированный хардкод для проверки работоспособности заданных выводов.
    public static void main(String[] args) {
//        Customer[] array = Customer.createArray(5);
//        CustomerArray arrayCustomer = new CustomerArray(array);
//        array[0].setAllData(1,"Ivanov", "Ivan", "Ivanovich", 4260000010002301L,13571);
//        array[1].setAllData(2,"Ivanov", "Sergey", "Ivanovich", 4260000010002302L,13572);
//        array[2].setAllData(3,"Ivanov", "Ivan", "Sidorovich", 4260000010002303L,13573);
//        array[3].setAllData(4,"Ivanov", "Ivan", "Ivanovich", 4260000010002304L,13574);
//        array[4].setAllData(5,"Avinov", "Vladimir", "Sidorovich", 4260000010002305L,13575);
//        arrayCustomer.setArray(array);
//        //Проверяем сортировку по алфавиту.
//        arrayCustomer.alphabetSort();
//        for(Customer i: arrayCustomer.getArray()){
//            System.out.println(i.toString());
//        }
//        //Проверяем работу второго задания.
//        arrayCustomer.printCreditRange(4260000010002302L,4260000010002305L);
    }
}
