/*
   В этом проекте представлено четвёртое приложение из шестого модуля. Классы приложения расположены в своих пакетах,
   согласно логике. Код сопровожден минимальными комментариями. Основная информация по работе приложения представлена
   в файле README.md
 */

/*
    Задание 4. Многопоточность. Порт . Корабли заходят в порт для
    разгрузки/загрузки контейнеров. Число контейнеров, находящихся в текущий момент
    в порту и на корабле, должно быть неотрицательным и превышающим заданную
    грузоподъемность судна и вместимость порта. В порту работает несколько причалов.
    У одного причала может стоять один корабль. Корабль может загружаться у причала или разгружаться.
 */
public class Main {
}
